Основные_объекты_Занятие_6/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.СкидкиКонтрагентам</registerRecords>
  <registerRecords>InformationRegister.НашиЦены</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Основные_объекты_Занятие_6/src/InformationRegisters/НашиЦены/НашиЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НашиЦены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_6/src/InformationRegisters/СкидкиКонтрагентам/СкидкиКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиКонтрагентам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_6/src/Documents/УстановкаЦен/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.НашиЦены.Записывать = Истина;
	
	Для Каждого ТекСтрокаЦены Из Цены Цикл
			
			Движение = Движения.НашиЦены.Добавить();
			
			Движение.Период = Дата;
			
			Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
			Движение.Контрагент = Контрагент;
			
			Движение.Цена = ТекСтрокаЦены.Цена;

	КонецЦикла;
	
	
	
	Движения.СкидкиКонтрагентам.Записывать = Истина;
	
	Движение = Движения.СкидкиКонтрагентам.Добавить();
	
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Скидка = Скидка;
		

КонецПроцедуры
